In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.cluster import KMeans
from sklearn.preprocessing import MinMaxScaler

In [11]:
df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns', inplace = True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [13]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [14]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [15]:
inputs = pd.concat([inputs, dummies], axis = 'columns')
# concat
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [16]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [17]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [18]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [20]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [30]:
from sklearn.model_selection import train_test_split
X = inputs; y = target
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

In [31]:
len(X_train)

712

In [32]:
len(X_test)

179

In [33]:
len(inputs)

891

In [34]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [35]:
model.fit(X_train, y_train)

GaussianNB()

In [36]:
model.score(X_test, y_test)

0.8212290502793296

In [37]:
X_test[:10]

     Pclass        Age     Fare  female  male
131       3  20.000000   7.0500       0     1
807       3  18.000000   7.7750       1     0
579       3  32.000000   7.9250       0     1
410       3  29.699118   7.8958       0     1
666       2  25.000000  13.0000       0     1
596       2  29.699118  33.0000       1     0
163       3  17.000000   8.6625       0     1
261       3   3.000000  31.3875       0     1
587       1  60.000000  79.2000       0     1
452       1  30.000000  27.7500       0     1

In [38]:
y_test[:10]

131    0
807    0
579    1
410    0
666    0
596    1
163    0
261    1
587    1
452    0
Name: Survived, dtype: int64

In [39]:
model.predict(X_test[:10])

array([0, 1, 0, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [41]:
model.predict_proba(X_test[:10])

array([[0.98539808, 0.01460192],
       [0.06631807, 0.93368193],
       [0.98821477, 0.01178523],
       [0.98786647, 0.01213353],
       [0.97274881, 0.02725119],
       [0.03608982, 0.96391018],
       [0.98438238, 0.01561762],
       [0.9726899 , 0.0273101 ],
       [0.7012861 , 0.2987139 ],
       [0.91627334, 0.08372666]])